{
"e":[
  {
  "v":10,
  "ts":1519067121,
  "t":"Season 2 has begun. Update notes",
  "m":"Season 2 is out! The season 1 leaderboards will no longer be updating and you will get a reward tied to your profile based on which tier you landed in. See our previous post for tier breakdowns.\n\nOther than increasing your starting value to 1k instead of 100 there are no significant economy changes for now (don't want to change too many things at once).\n\nSome things to note about the season 2 patch:\n* Stale memes that you owned shares in at some point will now be sent to a new archive page after you sell everything. This is for those people who use the app as a pseudo reddit browser and keep shares in memes just so they can 'save' them in the app.\n* You can now buy 1/4 max and 1/2 max shares to make a diverse portfolio less tedious to set up.\n* Account backup now exists and works automatically. It will only store your NET BALANCE and username at the time you had the app open last. It will not store memes or your archive. However as per patch notes this is DEVICE SEPCIFIC. Cross device storage does not exist yet and we have pushed it back at least a few weeks due to complexity. Gameplay improvements currently have higher priority.\n\nNext priorities\n* Short term (1 day - 1 week) competitive trading leaderboards.\n* 'Prestige' resets/ranks.\n* Actual design work if we have time\n"
  },
  {
  "v":9,
  "ts":1518651012,
  "t":"Leaderboard reset and user profiles with profile rewards coming Monday Feb 19th 11:00am PST, /r/kekinvesting",
  "m":"Sorry for the lack of news lately, we've been busy working on our upcoming patch. Firstly, if you're interested in discussing Meme Exchange or posting feedback or questions, head on over to reddit.com/r/kekinvesting. It's a community run subreddit that we browse and try to post on when we have time.\n\nOn to the main news, Trade season 2 is here! We'll be releasing a patch on Monday that will reset everyone's leaderboard, as well as their account values back to the base amount. This coincides with user profiles being released so that we will be able to give out rewards based on your net worth at the time of the reset. How this will work:\n\n* Account balance will be reset\n* Portfolio memes will be moved to an 'Archive' page (accessible through your portfolio page. Archived memes will not be tradeable, and will have no value or value history)\n* Profile badges for trading season 1 will be distributed to all players, these will be distributed based on net worth as follows\n    Bronze pepe, 0-1K\n    Silver pepe, 1K-1M\n    Gold pepe, 1M-1T\n    Platinum pepe, 1T-1s\n    Diamond pepe, 1s-1S\n    Master trader pepe, 1S+\n\n* Lastly the patch will contain an account sync lite functionality. This will restore your account data on uninstall/reinstall of the app, but it will be tied to your current device. This will be temporary while we work on improved account sync that will support multiple devices. (this will take more time as multi device syncing has more edge cases and more potential to introduce bugs)\n\nOne we have this patch rolled out, our next priorities will be:\n* Multi-device sync\n* Short term (1 day - 1 week) competitive trading leaderboards.\n* 'Prestige' resets/ranks.\nWe're excited to get this patch out, and we hope you all enjoy it."
  },
  {
  "v":8,
  "ts":1518023388,
  "t":"9q purchase limit, upcoming features, and leaderboard reset.",
  "m":"There are a bunch of major upcoming changes to the game that we want to talk about.\n\n* First, a lot of people have mentioned the 9q share limit. This started as a technical limitation with our current implementation.\nWe decided to leave it in as exponentially growing values past a certain point cause a lot of problems and if everyone could cap out their account values at 340 undecillion (the max value of a double) then there would be nowhere to go for the leaderboard. So the cap isn't going anywhere any time soon.\nWe are working on features that should make it much more difficult to reach that cap however and make it basically irrelevant to the game.\n\n* Transaction fees. We'll be adding transaction fees in a coming release, not sure exactly what the numbers will be but each purchase and sale will cost a percentage of the total value of the transaction. This will help slow down the economy further and make the game more difficult.\n\n* Account syncing. We're currently working on more complete account data that can be sync'd across multiple phones and through uninstall/reinstall, we're aiming to release this in the next two to three weeks.\n\n* Profile badges/ranks/prestige resets. We're working on making the game more rewarding for long term use, we haven't fully designed this feature yet but it will be some kind of rank system dependent on spending a large amount of keks in order to increase your rank to the next tier, To be released hopefully within a month.\n* Short term leaderboards. These will be short term competition leaderboards (most growth in last day/week etc) that will go alongside the main leaderboard.\n\n* Finally, main leaderboard reset. When we release account syncing we will also be resetting the main leaderboard, as well as everyone's account balance. Early release kek inflation issues and exploits have made it nearly impossible for new users to compete on the leaderboard so we'll be resetting the values. Everyone will be given a profile badge / reward (these will be tiered based on your net worth at time of reset) for having been active for the first few months of the app's life.\n\nThanks for your support and all the great feedback we've received so far. We've been pretty swamped but we're doing our best to keep on top of it while working on all the new features!"
  },
  {
  "v":7,
  "ts":1517354952,
  "t":"Current development work and priorities",
  "m":"* Fix major memory usage on Meme page caused by ridiculously oversized meme images.\n* Remove posts with no image\n* Stop re-adding posts more than a day old\n* Accounts and data sync\n* Fix issue where homepage sometimes doesn't refresh right away\n* Design and implement some kind of shorter term leaderboards (daily/weekly rankings on various metrics)\n\nThanks for all of your feedback and kind words! We're trying our best to keep up with all your suggestions while also fixing the mess of bugs that have been reported. Please note - due to the volume of feedback, if you're seeing a bug/crash email is the best way to get help. Our email is appstronautstudios@gmail.com"
  },
  {
  "v":6,
  "ts":1517196373,
  "t":"1.2.9 patch notes",
  "m":"me_irl removed\n------------\nWe initially added it because a lot of people wanted the content, but after leaving it for a few hours and noticing that 60-70% of posts are coming from that spammy subreddit we're removing it again. We'll eventually have custom subreddits so you can follow whatever you like.\n\nmore stock data added\n------------\nWe tried to slim down our portfolio page to display just your current investment value and growth since purchase but a lot of people were unhappy with that. We've added back the data that was previously available in hopefully a more compressed and understandable format (including initial investment). Let us know if that works or if there's still more info you'd like to see\n\nCurrent development work and priorities\n---------------------------------------\n* Fix crashes\n* Fix major memory usage on Meme page caused by ridiculously oversized meme images.\n* Fix issue where homepage sometimes doesn't refresh right away\n* Design and implement some kind of shorter term leaderboards (daily/weekly rankings on various metrics)\n\nThanks for all of your feedback and kind words! We're trying our best to keep up with all your suggestions while also fixing the mess of bugs that have been reported."
  },
  {
  "v":5,
  "ts":1517011965,
  "t":"1.2.8 patch notes",
  "m":"EDIT: a lot of people are asking to have the init value of the investment on portfolio back. We're doing this now\n\nThis patch will address several issues we should mention.\n\nBalance changes\n---------------\nSeveral people have been complaining that the game is too easy. To this end we've taken some early first steps and added a degradation component to our kek cost value for a meme. This means you can no longer hold onto all the memes you can buy for several days with minimum risk. If you hold a meme for too long it will go normie at some point and start freefalling.\n\nme_irl added\n------------\nLots of requests to do this. We realize not everyone will like all the memes so we're going to eventually allow you to customize your stock feed.\n\nUI improvements and purchase history\n------------------------------------\nSeveral people have emailed/left feedback talking about how growth was affected strangely when they bought or sold the same multiple times (not just buy once & sell all). To address this we're adding a purchase history of your transaction. It's only partially complete so for now it will show the AVERAGE of growth across all your purchases. This is not entirely accurate as having one purchase of 100 shares with 100% growth and another purchase of 100M shares of the same meme with 200% growth will show a growth as 150% even though it is technically very close to 200% as the 100 share purchase would be irrelevant in comparison to the 100M purchase.\n\nPerformance\n---------------\nAs always we're doing our best to make the app less chunky. Some of our refresh code should be a little more efficient now. We're also going to reduce the size of the meme images that are being pulled from reddit. Some are massive and can lock up older phones pretty good."
  },
  {
  "v":4,
  "ts":1516830432,
  "t":"Patch 1.2.7 - performance fix",
  "m":"Skip right on over patch 1.2.6 and grab patch 1.2.7 before it goes normie. We introduced a minor bug in 1.2.5 that would compound over time and cause heavy performance losses, this issue should be completely fixed in patch 1.2.7.\nWe've also added a new meme filtering menu on the home page as well as some small UI improvements across the board. Try it out and make sure you report any bugs you find to us.\n\nAlso small side note, we have no official social media presence, all official information about the app should come from here or the patch notes, except that we both occasionally post on reddit as /u/alexgophermix and /u/blapblapdiddlydoodah"
  },
  {
  "v":3,
  "ts":1516313652,
  "t":"Developer updates",
  "m":"This is our first developer update. We'll post important news and development related messages for Meme Exchange here. Here's a list of our current development work and priorities.\n\n* Fixing remaining crashes\n* Fixing issue where homepage sometimes doesn't refresh right away\n* Reduce server costs by optimizing leaderboards performance and user experience (navigating 10k+ leaderboard entries can be difficult)\n* Improve game balance and add more risk (most posts will still remain neutral or go up atm)\n* Designing and implementing some kind of shorter term leaderboards (daily/weekly rankings on various metrics)\n\nThanks for all of your support and kind words!"
  }
]
}
